# SQL: Selection Queries

## Setup

We are now installing the necessary packages to interact with the MySQL database and issue SQL queries using the notebook.

In [1]:
!apt-get install python3-mysqldb
!pip3 install -U sqlalchemy sql_magic

E: Could not open lock file /var/lib/dpkg/lock-frontend - open (13: Permission denied)
E: Unable to acquire the dpkg frontend lock (/var/lib/dpkg/lock-frontend), are you root?
Defaulting to user installation because normal site-packages is not writeable
Collecting sqlalchemy
  Downloading SQLAlchemy-1.3.15.tar.gz (6.1 MB)
     |████████████████████████████████| 6.1 MB 45.4 MB/s eta 0:00:01
  Installing build dependencies ... done
  Getting requirements to build wheel ... done
    Preparing wheel metadata ... done
Requirement already up-to-date: sql_magic in /usr/local/lib/python3.6/dist-packages (0.0.4)
Requirement already satisfied, skipping upgrade: ipython in /usr/local/lib/python3.6/dist-packages (from sql_magic) (7.12.0)
Requirement already satisfied, skipping upgrade: jupyter in /usr/local/lib/python3.6/dist-packages (from sql_magic) (1.0.0)
Requirement already satisfied, skipping upgrade: findspark in /usr/local/lib/python3.6/dist-packages (from sql_magic) (1.3.0)
Requirement already satisfied, skipping upgrade: pandas in /usr/local/lib/python3.6/dist-packages (from sql_magic) (1.0.1)
Requirement already satisfied, skipping upgrade: sqlparse in /usr/local/lib/python3.6/dist-packages (from sql_magic) (0.3.0)
Requirement already satisfied, skipping upgrade: traitlets in /usr/local/lib/python3.6/dist-packages (from sql_magic) (4.3.3)
Requirement already satisfied, skipping upgrade: decorator in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (4.4.1)
Requirement already satisfied, skipping upgrade: backcall in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (0.1.0)
Requirement already satisfied, skipping upgrade: pygments in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (2.5.2)
Requirement already satisfied, skipping upgrade: pexpect; sys_platform != "win32" in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (4.8.0)
Requirement already satisfied, skipping upgrade: setuptools>=18.5 in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (42.0.2)
Requirement already satisfied, skipping upgrade: jedi>=0.10 in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (0.16.0)
Requirement already satisfied, skipping upgrade: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (3.0.3)
Requirement already satisfied, skipping upgrade: pickleshare in /usr/local/lib/python3.6/dist-packages (from ipython->sql_magic) (0.7.5)
Requirement already satisfied, skipping upgrade: nbconvert in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (5.6.1)
Requirement already satisfied, skipping upgrade: ipykernel in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (5.1.4)
Requirement already satisfied, skipping upgrade: notebook in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (6.0.3)
Requirement already satisfied, skipping upgrade: qtconsole in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (4.6.0)
Requirement already satisfied, skipping upgrade: jupyter-console in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (6.1.0)
Requirement already satisfied, skipping upgrade: ipywidgets in /usr/local/lib/python3.6/dist-packages (from jupyter->sql_magic) (7.5.1)
Requirement already satisfied, skipping upgrade: python-dateutil>=2.6.1 in /usr/local/lib/python3.6/dist-packages (from pandas->sql_magic) (2.8.1)
Requirement already satisfied, skipping upgrade: numpy>=1.13.3 in /usr/local/lib/python3.6/dist-packages (from pandas->sql_magic) (1.18.1)
Requirement already satisfied, skipping upgrade: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas->sql_magic) (2019.3)
Requirement already satisfied, skipping upgrade: ipython-genutils in /usr/local/lib/python3.6/dist-packages (from traitlets->sql_magic) (0.2.0)
Requirement already satisfied, skipping upgrade: six in /usr/local/lib/python3.6/dist-packages (from traitlets->sql_magic) (1.14.0)
Requirement already satisfied, skipping upgrade: ptyprocess>=0.5 in /usr/local/lib/python3.6/dist-packages (from pexpect; sys_platform != "win32"->ipython->sql_magic) (0.6.0)
Requirement already satisfied, skipping upgrade: parso>=0.5.2 in /usr/local/lib/python3.6/dist-packages (from jedi>=0.10->ipython->sql_magic) (0.6.1)
Requirement already satisfied, skipping upgrade: wcwidth in /usr/local/lib/python3.6/dist-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython->sql_magic) (0.1.8)
Requirement already satisfied, skipping upgrade: jupyter-core in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (4.6.3)
Requirement already satisfied, skipping upgrade: bleach in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (3.1.1)
Requirement already satisfied, skipping upgrade: mistune<2,>=0.8.1 in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (0.8.4)
Requirement already satisfied, skipping upgrade: entrypoints>=0.2.2 in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (0.3)
Requirement already satisfied, skipping upgrade: nbformat>=4.4 in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (5.0.4)
Requirement already satisfied, skipping upgrade: defusedxml in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (0.6.0)
Requirement already satisfied, skipping upgrade: testpath in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (0.4.4)
Requirement already satisfied, skipping upgrade: pandocfilters>=1.4.1 in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (1.4.2)
Requirement already satisfied, skipping upgrade: jinja2>=2.4 in /usr/local/lib/python3.6/dist-packages (from nbconvert->jupyter->sql_magic) (2.11.1)
Requirement already satisfied, skipping upgrade: jupyter-client in /usr/local/lib/python3.6/dist-packages (from ipykernel->jupyter->sql_magic) (6.0.0)
Requirement already satisfied, skipping upgrade: tornado>=4.2 in /usr/local/lib/python3.6/dist-packages (from ipykernel->jupyter->sql_magic) (6.0.3)
Requirement already satisfied, skipping upgrade: terminado>=0.8.1 in /usr/local/lib/python3.6/dist-packages (from notebook->jupyter->sql_magic) (0.8.3)
Requirement already satisfied, skipping upgrade: pyzmq>=17 in /usr/local/lib/python3.6/dist-packages (from notebook->jupyter->sql_magic) (19.0.0)
Requirement already satisfied, skipping upgrade: prometheus-client in /usr/local/lib/python3.6/dist-packages (from notebook->jupyter->sql_magic) (0.7.1)
Requirement already satisfied, skipping upgrade: Send2Trash in /usr/local/lib/python3.6/dist-packages (from notebook->jupyter->sql_magic) (1.5.0)
Requirement already satisfied, skipping upgrade: widgetsnbextension~=3.5.0 in /usr/local/lib/python3.6/dist-packages (from ipywidgets->jupyter->sql_magic) (3.5.1)
Requirement already satisfied, skipping upgrade: webencodings in /usr/local/lib/python3.6/dist-packages (from bleach->nbconvert->jupyter->sql_magic) (0.5.1)
Requirement already satisfied, skipping upgrade: jsonschema!=2.5.0,>=2.4 in /usr/local/lib/python3.6/dist-packages (from nbformat>=4.4->nbconvert->jupyter->sql_magic) (3.2.0)
Requirement already satisfied, skipping upgrade: MarkupSafe>=0.23 in /usr/local/lib/python3.6/dist-packages (from jinja2>=2.4->nbconvert->jupyter->sql_magic) (1.1.1)
Requirement already satisfied, skipping upgrade: pyrsistent>=0.14.0 in /usr/local/lib/python3.6/dist-packages (from jsonschema!=2.5.0,>=2.4->nbformat>=4.4->nbconvert->jupyter->sql_magic) (0.15.7)
Requirement already satisfied, skipping upgrade: attrs>=17.4.0 in /usr/local/lib/python3.6/dist-packages (from jsonschema!=2.5.0,>=2.4->nbformat>=4.4->nbconvert->jupyter->sql_magic) (19.3.0)
Requirement already satisfied, skipping upgrade: importlib-metadata; python_version < "3.8" in /usr/local/lib/python3.6/dist-packages (from jsonschema!=2.5.0,>=2.4->nbformat>=4.4->nbconvert->jupyter->sql_magic) (1.5.0)
Requirement already satisfied, skipping upgrade: zipp>=0.5 in /usr/local/lib/python3.6/dist-packages (from importlib-metadata; python_version < "3.8"->jsonschema!=2.5.0,>=2.4->nbformat>=4.4->nbconvert->jupyter->sql_magic) (3.0.0)
Building wheels for collected packages: sqlalchemy

  Building wheel for sqlalchemy (PEP 517) ... done
  Created wheel for sqlalchemy: filename=SQLAlchemy-1.3.15-cp36-cp36m-linux_x86_64.whl size=1228316 sha256=1468d26251a746d2ba5916c53db346d726dcb7e5fae22427ebc403facee94e1a
  Stored in directory: /home/ubuntu/.cache/pip/wheels/4a/1b/3a/c73044d7be48baeb47cbee343334f7803726ca1e9ba7b29095
Successfully built sqlalchemy
Installing collected packages: sqlalchemy
Successfully installed sqlalchemy-1.3.15

In [2]:
%reload_ext sql_magic

In [3]:
from sqlalchemy import create_engine

conn_string = 'mysql://{user}:{password}@{host}/?charset=utf8'.format(
    host='db.ipeirotis.org',
    user='student',
    password='dwdstudent2015',
    encoding='utf-8')
engine = create_engine(conn_string)

In [4]:
%config SQL.conn_name = 'engine'

## `SELECT *`

### IMDb

In [5]:
%%read_sql
USE imdb

Query started at 06:06:15 PM UTC; Query executed in 0.01 m

#### Return all movies

In [6]:
%%read_sql
SELECT *
FROM movies

Query started at 06:06:15 PM UTC; Query executed in 0.02 m

            id                                 name  year  rank
0            0                                  #28  2002   NaN
1            1  #7 Train: An Immigrant Journey, The  2000   NaN
2            2                                    $  1971   6.4
3            3                        $1,000 Reward  1913   NaN
4            4                        $1,000 Reward  1915   NaN
...        ...                                  ...   ...   ...
388264  412316                      "zem blch krlu"  1991   NaN
388265  412317                             "rgammk"  1995   NaN
388266  412318                         "zgnm Leyla"  2002   NaN
388267  412319                          " Istanbul"  1983   NaN
388268  412320                          "sterreich"  1958   NaN

[388269 rows x 4 columns]

#### Return all directors

In [7]:
%%read_sql
SELECT *
FROM directors

Query started at 06:06:16 PM UTC; Query executed in 0.01 m

          id first_name    last_name
0          1       Todd            1
1          2        Les  12 Poissons
2          3    Lejaren     a'Hiller
3          4       Nian            A
4          5   Khairiya    A-Mansour
...      ...        ...          ...
86875  88797      Yusuf         Ünal
86876  88798      Ahmet        Ündag
86877  88799       Idil         Üner
86878  88800     Yüksel        Ünsal
86879  88801      Ahmet        Üstel

[86880 rows x 3 columns]

#### Return all actors

In [8]:
%%read_sql
SELECT *
FROM actors

Query started at 06:06:17 PM UTC; Query executed in 0.03 m

            id     first_name           last_name gender
0            2        Michael  'babeepower' Viera      M
1            3           Eloy         'Chincheta'      M
2            4       Dieguito         'El Cigala'      M
3            5        Antonio    'El de Chipiona'      M
4            6           José        'El Francés'      M
...        ...            ...                 ...    ...
817713  845461         Herdís      Þorvaldsdóttir      F
817714  845462  Katla Margrét      Þorvaldsdóttir      F
817715  845463     Lilja Nótt      Þórarinsdóttir      F
817716  845464     Hólmfríður      Þórhallsdóttir      F
817717  845465       Theódóra        Þórðardóttir      F

[817718 rows x 4 columns]

#### Return all roles

In [9]:
%%read_sql
SELECT *
FROM roles

Query started at 06:06:19 PM UTC; Query executed in 0.13 m

         actor_id  movie_id              role
0               2    280088            Stevie
1               2    396232  Various/lyricist
2               3    376687          Gitano 1
3               4    336265         El Cigala
4               5    135644           Himself
...           ...       ...               ...
3432625    845461    137097              Kata
3432626    845462    208838             Magga
3432627    845463       870             Gunna
3432628    845464    378123            Gudrun
3432629    845465    378123              None

[3432630 rows x 3 columns]

#### Return all genres for the movies

In [10]:
%%read_sql
SELECT *
FROM movies_genres

Query started at 06:06:27 PM UTC; Query executed in 0.01 m

        movie_id        genre
0              1        Short
1              1  Documentary
2              2        Crime
3              2       Comedy
4              5      Western
...          ...          ...
417779    378612    Adventure
417780    378612        Drama
417781    378613       Comedy
417782    378613        Drama
417783    378614       Comedy

[417784 rows x 2 columns]

### Facebook

In [11]:
%%read_sql
USE facebook

Query started at 06:06:27 PM UTC; Query executed in 0.00 m

#### Return all students

In [12]:
%%read_sql
SELECT *
FROM Profiles

Query started at 06:06:27 PM UTC; Query executed in 0.01 m

,ProfileID,Name,MemberSince,LastUpdate,School,Status,Sex,Birthday,AIM,Website,PoliticalViews,Geography,HighSchool,HomeTown,HomeState,Residence,CurrentAddress,CurrentTown,CurrentState
0,800001,The Creator,2004-03-07,2005-02-15,NYU '06,Undergrad,Female,NaT,None,None,None,None,None,None,None,None,None,None,None
1,800002,Brian Whitton,2004-03-22,2006-01-11,NYU '07,Undergrad,Male,1984-12-16,bedubbs1,http://www.flickr.com/photos/dubbs,Libertarian,None,George W.Hewlett High School,"Valley Stream, NY",None,None,None,None,None
2,800003,Anita Nagwani,2004-03-22,2006-01-17,NYU '05,Alumnus/Alumna,Female,1984-01-19,chiquita545,None,None,"Atlanta, GA",Ward Melville Senior High School '02,"Stony Brook, NY",None,None,None,None,None
3,800004,Sunny Kim,2004-03-22,2006-01-06,NYU '07,Undergrad,Female,1985-08-08,sunnyi3unny,http://www.livejournal.com/~sunnyi3unny,Conservative,None,West Windsor Plainsboro High School South '03,"Plainsboro, NJ",None,Thirteenth Street 5AN,None,None,None
4,800005,Ariel Podwal,2004-03-22,2006-01-16,NYU '07,Undergrad,Male,1985-05-29,ClayBandit,http://www.twoshotsofrye.com,None,None,Harrison High School '03,"Harrison, NY",None,Palladium 524D,None,None,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
25779,834637,Jen Slovin,2006-01-18,2006-01-18,NYU '08,Undergrad,Female,1985-12-17,None,None,None,None,Worcester Academy '04,"Westborough, MA 01581",None,Water Street,None,None,None
25780,834638,Kumi Dikengil,2006-01-18,NaT,NYU,Alumnus/Alumna,None,NaT,None,None,None,None,None,None,None,None,None,None,None
25781,834639,Sky Gaven,2006-01-19,NaT,NYU,Undergrad,None,NaT,None,None,None,None,None,None,None,None,None,None,None
25782,834640,Eli Brown,2005-12-27,NaT,NYU,Grad Student,None,NaT,None,None,None,None,None,None,None,None,None,None,None
25783,834641,Tunga Mbia,2006-01-19,NaT,NYU,Undergrad,None,NaT,None,None,None,None,None,None,None,None,None,None,None

#### Return the hobbies of all students

In [13]:
%%read_sql
SELECT *
FROM Hobbies

Query started at 06:06:28 PM UTC; Query executed in 0.01 m

        ProfileID                                 Hobby
0          800001                       Creating Things
1          800001  Making Light Where There Is Darkness
2          800001               Smiting The Disobedient
3          800001                    Speaking The Truth
4          800001             And Of Course Programming
...           ...                                   ...
144408     834634                           Good Movies
144409     834634                                 Anime
144410     834634                           Video Games
144411     834634                       New Discoveries
144412     834634                      Religious Debate

[144413 rows x 2 columns]

#### Return the relationship status for all students

In [14]:
%%read_sql
SELECT *
FROM Relationship

Query started at 06:06:28 PM UTC; Query executed in 0.00 m

       ProfileID             Status
0         800002             Single
1         800003  In a Relationship
2         800004             Single
3         800005             Single
4         800006            Married
...          ...                ...
15638     834612  In a Relationship
15639     834614             Single
15640     834628             Single
15641     834634             Single
15642     834636   It's complicated

[15643 rows x 2 columns]

#### Return what students are looking for

In [15]:
%%read_sql
SELECT *
FROM LookingFor

Query started at 06:06:28 PM UTC; Query executed in 0.00 m

       ProfileID          LookingFor
0         800002          Friendship
1         800002              Dating
2         800002      A Relationship
3         800004          Friendship
4         800006          Friendship
...          ...                 ...
16892     834634              Dating
16893     834634      A Relationship
16894     834634         Random play
16895     834634  Whatever I can get
16896     834636  Whatever I can get

[16897 rows x 2 columns]

## `SELECT` _attr_

### IMDb

In [16]:
%%read_sql
USE imdb

Query started at 06:06:29 PM UTC; Query executed in 0.00 m

#### Return the first and last names of actors

In [17]:
%%read_sql
SELECT first_name, last_name
FROM actors

Query started at 06:06:29 PM UTC; Query executed in 0.02 m

           first_name           last_name
0             Michael  'babeepower' Viera
1                Eloy         'Chincheta'
2            Dieguito         'El Cigala'
3             Antonio    'El de Chipiona'
4                José        'El Francés'
...               ...                 ...
817713         Herdís      Þorvaldsdóttir
817714  Katla Margrét      Þorvaldsdóttir
817715     Lilja Nótt      Þórarinsdóttir
817716     Hólmfríður      Þórhallsdóttir
817717       Theódóra        Þórðardóttir

[817718 rows x 2 columns]

#### Return year and ranking for each movie

In [18]:
%%read_sql
SELECT year, rank
FROM movies

Query started at 06:06:30 PM UTC; Query executed in 0.01 m

        year  rank
0       2002   NaN
1       2000   NaN
2       1971   6.4
3       1913   NaN
4       1915   NaN
...      ...   ...
388264  1991   NaN
388265  1995   NaN
388266  2002   NaN
388267  1983   NaN
388268  1958   NaN

[388269 rows x 2 columns]

### Facebook

In [19]:
%%read_sql
USE facebook

Query started at 06:06:31 PM UTC; Query executed in 0.00 m

#### Return Name, Sex, and Birthday of all students

In [20]:
%%read_sql
SELECT Name, Sex, Birthday
FROM Profiles

Query started at 06:06:31 PM UTC; Query executed in 0.00 m

                Name     Sex   Birthday
0        The Creator  Female        NaT
1      Brian Whitton    Male 1984-12-16
2      Anita Nagwani  Female 1984-01-19
3          Sunny Kim  Female 1985-08-08
4       Ariel Podwal    Male 1985-05-29
...              ...     ...        ...
25779     Jen Slovin  Female 1985-12-17
25780  Kumi Dikengil    None        NaT
25781      Sky Gaven    None        NaT
25782      Eli Brown    None        NaT
25783     Tunga Mbia    None        NaT

[25784 rows x 3 columns]

#### Return Sex, and Political Views of all students

In [21]:
%%read_sql
SELECT Sex, PoliticalViews
FROM Profiles

Query started at 06:06:31 PM UTC; Query executed in 0.00 m

          Sex PoliticalViews
0      Female           None
1        Male    Libertarian
2      Female           None
3      Female   Conservative
4        Male           None
...       ...            ...
25779  Female           None
25780    None           None
25781    None           None
25782    None           None
25783    None           None

[25784 rows x 2 columns]

#### Return the Relationship status column

In [22]:
%%read_sql
SELECT Status
FROM Relationship

Query started at 06:06:31 PM UTC; Query executed in 0.00 m

                  Status
0                 Single
1      In a Relationship
2                 Single
3                 Single
4                Married
...                  ...
15638  In a Relationship
15639             Single
15640             Single
15641             Single
15642   It's complicated

[15643 rows x 1 columns]

## `SELECT` _attr_ `AS` _alias_

### IMDb

In [23]:
%%read_sql
USE imdb

Query started at 06:06:31 PM UTC; Query executed in 0.00 m

#### Return id, first, and last names of actors. Rename id to “actor_id”

In [24]:
%%read_sql
SELECT id AS actor_id, first_name, last_name
FROM actors

Query started at 06:06:31 PM UTC; Query executed in 0.03 m

        actor_id     first_name           last_name
0              2        Michael  'babeepower' Viera
1              3           Eloy         'Chincheta'
2              4       Dieguito         'El Cigala'
3              5        Antonio    'El de Chipiona'
4              6           José        'El Francés'
...          ...            ...                 ...
817713    845461         Herdís      Þorvaldsdóttir
817714    845462  Katla Margrét      Þorvaldsdóttir
817715    845463     Lilja Nótt      Þórarinsdóttir
817716    845464     Hólmfríður      Þórhallsdóttir
817717    845465       Theódóra        Þórðardóttir

[817718 rows x 3 columns]

#### Return name, year, and rank for each movie. Rename name to “movie_title”, year to “release_year”, and rank to “rating”

In [25]:
%%read_sql
SELECT name AS movie_title, year AS release_year, rank AS rating
FROM movies

Query started at 06:06:33 PM UTC; Query executed in 0.01 m

                                movie_title  release_year  rating
0                                       #28          2002     NaN
1       #7 Train: An Immigrant Journey, The          2000     NaN
2                                         $          1971     6.4
3                             $1,000 Reward          1913     NaN
4                             $1,000 Reward          1915     NaN
...                                     ...           ...     ...
388264                      "zem blch krlu"          1991     NaN
388265                             "rgammk"          1995     NaN
388266                         "zgnm Leyla"          2002     NaN
388267                          " Istanbul"          1983     NaN
388268                          "sterreich"          1958     NaN

[388269 rows x 3 columns]

### Facebook

In [26]:
%%read_sql
USE facebook

Query started at 06:06:34 PM UTC; Query executed in 0.00 m

#### Return Sex and Status of all students. Rename Sex to Gender and Status to UniversityStatus

In [27]:
%%read_sql
SELECT Sex AS Gender, Status AS UniversityStatus
FROM Profiles

Query started at 06:06:34 PM UTC; Query executed in 0.00 m

       Gender UniversityStatus
0      Female        Undergrad
1        Male        Undergrad
2      Female   Alumnus/Alumna
3      Female        Undergrad
4        Male        Undergrad
...       ...              ...
25779  Female        Undergrad
25780    None   Alumnus/Alumna
25781    None        Undergrad
25782    None     Grad Student
25783    None        Undergrad

[25784 rows x 2 columns]

## `SELECT DISTINCT`

### IMDb

In [28]:
%%read_sql
USE imdb

Query started at 06:06:34 PM UTC; Query executed in 0.00 m

#### Find all the movie genres

In [29]:
%%read_sql
SELECT DISTINCT genre
FROM movies_genres

Query started at 06:06:34 PM UTC; Query executed in 0.01 m

          genre
0         Short
1   Documentary
2         Crime
3        Comedy
4       Western
5        Family
6     Animation
7         Drama
8       Romance
9       Mystery
10     Thriller
11        Adult
12        Music
13       Action
14      Fantasy
15       Sci-Fi
16       Horror
17          War
18      Musical
19    Adventure
20    Film-Noir

### Facebook

In [30]:
%%read_sql
USE facebook

Query started at 06:06:35 PM UTC; Query executed in 0.00 m

#### Return the distinct PoliticalViews from the Profiles table

In [31]:
%%read_sql
SELECT DISTINCT PoliticalViews
FROM Profiles

Query started at 06:06:35 PM UTC; Query executed in 0.00 m

      PoliticalViews
0               None
1        Libertarian
2       Conservative
3            Liberal
4          Apathetic
5           Moderate
6       Very Liberal
7  Very Conservative
8              Other

#### Return the distinct Sex values from the Profiles table

In [32]:
%%read_sql
SELECT DISTINCT Sex
FROM Profiles

Query started at 06:06:35 PM UTC; Query executed in 0.00 m

      Sex
0  Female
1    Male
2    None

#### Find what students are “LookingFor”

In [33]:
%%read_sql
SELECT DISTINCT LookingFor
FROM LookingFor

Query started at 06:06:35 PM UTC; Query executed in 0.00 m

           LookingFor
0          Friendship
1              Dating
2      A Relationship
3  Whatever I can get
4         Random play

#### Find all possible “Relationship” statuses

In [34]:
%%read_sql
SELECT DISTINCT Status
FROM Relationship

Query started at 06:06:35 PM UTC; Query executed in 0.00 m

                    Status
0                   Single
1        In a Relationship
2                  Married
3  In an Open Relationship
4         It's complicated
5                  Engaged

#### Find all possible Concentrations

In [35]:
%%read_sql
SELECT DISTINCT Concentration
FROM Concentration

Query started at 06:06:35 PM UTC; Query executed in 0.00 m

                                 Concentration
0                                   Psychology
1                             Computer Science
2                             Creative Writing
3                            Film & Television
4                                    Economics
..                                         ...
134                          Music Composition
135                       college of dentistry
136  Interactive Telecommunications Department
137                       Occupational Therapy
138                             Slavic Studies

[139 rows x 1 columns]

## `ORDER BY` and `LIMIT`

### IMDb

In [36]:
%%read_sql
USE imdb

Query started at 06:06:36 PM UTC; Query executed in 0.00 m

#### Find the top-10 ranked movies
* Rank by “rank” first (descending order)
* Break ties using “year”
* Break remaining ties using “name”

In [37]:
%%read_sql
SELECT *
FROM movies
ORDER BY rank DESC, year, name
LIMIT 10

Query started at 06:06:36 PM UTC; Query executed in 0.01 m

       id                         name  year  rank
0   84983          Devil's Circus, The  1926   9.9
1  227596            Napolon Bonaparte  1934   9.9
2   94558                    Duck Soup  1942   9.9
3  343965  Ubijtsi vykhodyat na dorogu  1942   9.9
4   87894            Distinto amanecer  1943   9.9
5  320483                       Svadba  1944   9.9
6  313896            Star povesti cesk  1953   9.9
7  347078     Unicorn in the Garden, A  1953   9.9
8  320710          Svoga tela gospodar  1957   9.9
9  246768             Pair of Boots, A  1962   9.9

#### List all the distinct years of the movies, in descending order

In [38]:
%%read_sql
SELECT DISTINCT year
FROM movies
ORDER BY year DESC

Query started at 06:06:36 PM UTC; Query executed in 0.00 m

     year
0    2008
1    2007
2    2006
3    2005
4    2004
..    ...
115  1893
116  1892
117  1891
118  1890
119  1888

[120 rows x 1 columns]

### Facebook

In [39]:
%%read_sql
USE facebook

Query started at 06:06:36 PM UTC; Query executed in 0.00 m

#### List the first 50 students that joined Facebook at NYU (use the “MemberSince” attribute)

In [40]:
%%read_sql
SELECT *
FROM Profiles
ORDER BY MemberSince 
LIMIT 50

Query started at 06:06:36 PM UTC; Query executed in 0.00 m

,ProfileID,Name,MemberSince,LastUpdate,School,Status,Sex,Birthday,AIM,Website,PoliticalViews,Geography,HighSchool,HomeTown,HomeState,Residence,CurrentAddress,CurrentTown,CurrentState
0,800001,The Creator,2004-03-07,2005-02-15,NYU '06,Undergrad,Female,NaT,None,None,None,None,None,None,None,None,None,None,None
1,834305,Eric Berry,2004-03-15,2005-11-07,NYU '05,Alumnus/Alumna,Male,1980-10-03,None,None,Liberal,"New York, NY",Hackley '99,"Chicago, IL 60622",None,Bexley Hall,None,None,None
2,800002,Brian Whitton,2004-03-22,2006-01-11,NYU '07,Undergrad,Male,1984-12-16,bedubbs1,http://www.flickr.com/photos/dubbs,Libertarian,None,George W.Hewlett High School,"Valley Stream, NY",None,None,None,None,None
3,800003,Anita Nagwani,2004-03-22,2006-01-17,NYU '05,Alumnus/Alumna,Female,1984-01-19,chiquita545,None,None,"Atlanta, GA",Ward Melville Senior High School '02,"Stony Brook, NY",None,None,None,None,None
4,800004,Sunny Kim,2004-03-22,2006-01-06,NYU '07,Undergrad,Female,1985-08-08,sunnyi3unny,http://www.livejournal.com/~sunnyi3unny,Conservative,None,West Windsor Plainsboro High School South '03,"Plainsboro, NJ",None,Thirteenth Street 5AN,None,None,None
5,800005,Ariel Podwal,2004-03-22,2006-01-16,NYU '07,Undergrad,Male,1985-05-29,ClayBandit,http://www.twoshotsofrye.com,None,None,Harrison High School '03,"Harrison, NY",None,Palladium 524D,None,None,None
6,800006,Erica Bern,2004-03-22,2006-01-12,NYU '07,Undergrad,Female,NaT,eriqua143,None,None,None,Ardsley High School '03,None,NY,None,2nd ave meat market,None,None
7,800007,David Cai,2004-03-22,2005-12-26,NYU '06,Alumnus/Alumna,Male,1983-11-21,zgfunkz,None,None,"New York, NY",East Brunswick High School '02,"East Brunswick, NJ 08816",None,None,None,None,None
8,800008,Stephanie Lai,2004-03-22,2005-12-22,NYU '07,Undergrad,Female,1985-06-12,socks4414,None,Liberal,None,Millburn Senior High School '03,"Short Hills, NJ",None,Carlyle Court,None,None,None
9,800009,Haley Hartsfield,2004-03-22,2005-12-10,NYU '06,Undergrad,Female,NaT,haley hh,None,None,None,Booker T.Washington High School '02,"Big D, TX",None,None,None,None,None
10,800010,Jeff Chlystun,2004-03-22,2006-01-16,NYU '06,Faculty,Male,1983-12-20,RedGiraffeBot,http://www.watchstevelewsuckthediack.com,Apathetic,None,Red Hook Senior High School '02,"Red Hook, NY 12571",None,None,None,None,None
11,800011,Charles Kerecz,2004-03-22,2006-01-14,NYU '06,Undergrad,Male,1984-02-15,None,None,Conservative,None,Fordham Prep '02,None,None,None,None,None,None
12,800012,Josh Fern,2004-03-22,2006-01-16,NYU '07,Undergrad,Male,1985-10-03,GameSetMatch108,None,Liberal,None,Fox Lane High School '03,"Bedford, NY 10506",None,Palladium 524F,None,None,None
13,800013,Blaine Davis,2004-03-22,2006-01-17,NYU '07,Undergrad,Male,1984-08-28,Enialb2,None,Liberal,None,Ray High School,"Corpus Christi, TX 78404",None,None,Transient in New York,None,None
14,800014,Yoome Kim,2004-03-22,NaT,NYU,Undergrad,None,NaT,None,None,None,None,None,None,None,None,None,None,None
15,800015,Sacha Kenton,2004-03-22,2005-12-12,NYU '04,Alumnus/Alumna,Female,1982-07-11,TygraLilie,http://www.cfids.org,Liberal,None,None,None,None,None,None,None,None
16,800016,Anna Gekker,2004-03-22,2006-01-17,NYU '07,Undergrad,Female,1985-11-03,Frick321,None,Moderate,None,Brooklyn Technical High School '03,"Brooklyn, NY",None,Greenwich Hotel,None,None,None
17,800017,Kelly Quann,2004-03-22,2005-12-21,NYU '07,Undergrad,Female,1984-11-09,None,None,Liberal,None,Bensalem Township High School '03,"Bucks County, PA",None,Carlyle Court C13G,None,None,None
18,800018,Rohit Dave,2004-03-22,2006-01-03,NYU '07,Undergrad,Male,1985-08-04,None,None,None,None,Jackson Memorial High School,"Jackson, NJ",None,Greenwich Hotel,None,None,None
19,800019,Anne Klingeberger,2004-03-22,2006-01-06,NYU '07,Undergrad,Female,1984-08-31,lilorphanannee,None,Very Liberal,None,Lake Central High School '03,"Schererville, IN",None,Prague OSADNI,"25 Union Square West New York, NY 10003",None,None
20,800020,Shaun Kasser,2004-03-22,2006-01-17,NYU '07,Undergrad,Male,1985-08-16,SCIPickin816,http://www.angelfire.com/film/kasser/new...,Moderate,None,Radnor Senior High School '03,"Wayne, PA 19087",None,Twentysixth Street 16H2,None,None,None
21,800021,Angeline Hsu,2004-03-22,2005-12-30,NYU '07,Undergrad,Female,1985-09-23,angiehsu85,None,Conservative,None,Windsor High School '03,"Windsor, CT 06095",None,Coral Towers 506,None,None,None
22,800022,Caroline Hendrix,2004-03-22,2006-01-12,NYU '07,Undergrad,Female,1985-02-14,MissCiciAG,http://pg.photos.yahoo.com/ph/caroline_h...,Apathetic,None,Lake Forest High School '03,"Villa Park, CA 92861",None,Kappa Psi Delta KYD LAFAYETTE,None,None,None
23,800023,Elizabeth Rislove,2004-03-22,2004-09-24,NYU '04,Alumnus/Alumna,Female,1982-07-12,Quickstep1001,None,Apathetic,None,Edina Senior High School '00,"Berkeley, CA 94702",None,None,None,None,None
24,800024,James Martinez,2004-03-22,2006-01-09,NYU '07,Undergrad,Male,NaT,fluxcapacitating,http://angryfrank.blogspot.com/,Moderate,None,None,"Riverside, CA",None,None,None,None,None
25,800025,Cathy Xu,2004-03-22,2006-01-16,NYU '07,Undergrad,Female,1985-04-03,GXNCX,http://www.youtube.com/?v=uQN3fHdPl0I,Moderate,None,Hunter College High School '03,"Forest Hills, Queens, NY",None,None,HahAHh go check out the website.. my friends a...,None,None
26,800026,Alice Doo,2004-03-22,2006-01-16,NYU '07,Undergrad,Female,1985-09-04,aLdiDDyO,http://community.webshots.com/user/alice...,None,None,Stamford High School '03,"Stamford, CT",None,None,macdougal @ houston,None,None
27,800027,Dave Birinyi,2004-03-22,2005-12-21,NYU '07,Undergrad,Male,1985-07-12,iheartjavelinas,http://homepages.nyu.edu/~dlb287/,Liberal,None,Garfield High School '03,"Seattle, WA 98119",None,None,"393 Hewes St, Apt 1E Brooklyn, NY 11211",None,None
28,800028,April Gu,2004-03-22,2006-01-09,NYU '06,Undergrad,Female,1984-04-14,Apr23HRH,None,Liberal,None,High Technology High School '02,"Colts Neck, NJ",None,None,None,None,None
29,800029,Aaron Platt,2004-03-22,2005-12-10,NYU '05,Alumnus/Alumna,Male,NaT,None,None,Liberal,"New York, NY",Parkland '01,None,None,None,None,None,None
30,800030,Stefanie Makar,2004-03-22,2006-01-18,NYU,Undergrad,Female,1984-06-20,SMAKAR,None,None,None,Concord High School '02,"Wilmington, DE 19810",None,None,None,"Jerusalem, ISRAEL",None
31,800031,Aiah Rachel,2004-03-22,2005-12-21,NYU '05,Alumnus/Alumna,Female,1984-04-28,maidofspades,None,Very Liberal,"New York, NY",Patchogue-Medford High '02,"New York, NY",None,None,None,None,None
32,800032,Ali Dedianko,2004-03-22,2006-01-13,NYU '07,Undergrad,Female,1985-02-20,None,None,Liberal,None,Dulaney High School '03,"Baltimore, MD",None,None,in transition...,None,None
33,800033,Santosh Sateesh,2004-03-22,2006-01-17,NYU '07,Undergrad,Male,1985-04-25,JTMarlin909,None,Liberal,None,pine view,"Sarasota, FLORIDA",None,Palladium 603,None,None,None
34,800034,Anthony Bustos,2004-03-22,2005-06-23,NYU '03,Alumnus/Alumna,Male,1981-05-26,None,None,None,None,None,None,None,None,None,None,None
35,800035,Holly Hamilton,2004-03-22,2006-01-11,NYU,Undergrad,None,NaT,None,None,None,None,Convent of the Sacred Heart High School,"San Francisco, CA",None,Palladium,None,None,None
36,800036,Yuriy Prilutskiy,2004-03-22,2005-11-13,NYU '07,Undergrad,Male,1985-12-14,yap36714a,None,None,None,Princeton High School '03,"Princeton, NJ",None,Palladium 1114,None,None,None
37,800037,Mel Lowden,2004-03-22,2005-12-12,NYU '07,Undergrad,Female,1984-12-08,airmelissa,None,None,None,Immaculata High School '03,"Basking Ridge, NJ",None,Lafayette Street 1406B,None,None,None
38,800038,Kathryn Nicole Howard,2004-03-22,2005-12-02,NYU '07,Undergrad,Female,1984-12-31,dot253,None,Moderate,None,Columbia Prep '03,"New York, NY 10028",None,Alumni Hall 8F11,None,None,None
39,800039,Rachel E Maran,2004-03-22,2005-12-11,NYU '08,Undergrad,Female,1984-06-29,cheech014,None,Liberal,None,Bronxville High School '02,"Bronxville, NY 10708",None,None,None,None,None
40,800040,Ange Hones,2004-03-22,2005-11-29,NYU '05,Alumnus/Alumna,Female,1983-01-18,lalaleonilla,None,Very Liberal,"New York, NY",Convent of the Sacred Heart High School '01,"Brooklyn, NY 11217",None,None,None,"Brooklyn, NEW YORK",None
41,800041,Michael Brodkin,2004-03-22,2005-06-13,NYU '04,Alumnus/Alumna,Male,NaT,None,None,None,"Phoenix, AZ",None,"Scarsdale, NY",None,None,None,None,None
42,800042,Anthony Spinelli,2004-03-22,2006-01-17,NYU '06,Undergrad,Male,NaT,scodalupo,None,None,None,None,"Morganville, NJ",None,Water Street 1712,None,None,None
43,800043,Tim McDermott,2004-03-22,2006-01-12,NYU '06,Alumnus/Alumna,Male,1983-11-14,minnizhome,None,Liberal,"New York, NY",C E Jordan High '02,"New York, NY 10004",None,None,None,None,None
44,800044,Josh Blye,2004-03-22,2005-11-02,NYU '06,Undergrad,Male,1984-04-19,SVENNN,None,Very Liberal,None,Ardsley High School '02,"Ardsley, NY 10502",None,None,None,None,None
45,800046,Derrick Chen,2004-03-22,2005-11-15,NYU '04,Alumnus/Alumna,Male,1982-02-15,derrickc82,None,Conservative,"New York, NY",Half Hollow Hills High School West '00,"New York, NY 10038",None,None,None,None,None
46,800047,Josh Keesan,2004-03-23,2005-09-14,NYU '06,Undergrad,Male,1984-03-29,jkeesan,None,Liberal,None,Brighton High School '02,"Rochester, NY 14618",None,Brittany Hall 203,None,None,None
47,800048,Kathleen Kane,2004-03-23,2005-10-26,NYU '07,Undergrad,Female,1984-09-28,kyk928,http://www.quizyourfriends.com/yourquiz....,Liberal,None,Cumberland Valley High School '03,None,PA,Palladium 916,None,None,None
48,800049,Mackenzie Condon,2004-03-23,2006-01-18,NYU,Alumnus/Alumna,Female,1985-09-12,mackenzi03,None,Libertarian,"Chicago, IL",Tampa Preparatory School '03,"Tampa, FL",None,None,None,None,None
49,800051,Janelle Dempsey,2004-03-23,2005-12-30,NYU '07,Undergrad,Female,1985-02-19,janellie219,None,Liberal,None,Buckingham Browne And Nichols '03,I'm a masshole,None,Lafayette Street,None,None,None

#### List the 10 students that have not updated their profiles for the longest time (use the “LastUpdate” attribute) – what is the problem?

In [41]:
%%read_sql
SELECT *
FROM Profiles
-- WHERE LastUpdate IS NOT NULL -- We need this filtering condition for the query to work as expected
ORDER BY LastUpdate
LIMIT 10

Query started at 06:06:37 PM UTC; Query executed in 0.00 m

,ProfileID,Name,MemberSince,LastUpdate,School,Status,Sex,Birthday,AIM,Website,PoliticalViews,Geography,HighSchool,HomeTown,HomeState,Residence,CurrentAddress,CurrentTown,CurrentState
0,800768,Karen Clemons,2004-04-01,None,NYU,Alumnus/Alumna,None,NaT,None,None,None,None,None,None,None,None,None,None,None
1,802048,Spenser Becker,2004-04-13,None,NYU,Undergrad,None,NaT,None,None,None,None,None,None,None,None,None,None,None
2,806656,Bob Ross,2004-05-26,None,NYU,Grad Student,Male,NaT,None,None,Very Conservative,None,None,None,None,NYU at the Seaport,None,None,None
3,806912,David Ambrose,2004-06-01,None,NYU,Faculty,Male,NaT,None,None,Moderate,None,Christiana High School '93,None,None,None,None,None,None
4,811776,Samantha Peller,2004-09-13,None,NYU,Grad Student,Female,1978-04-24,None,None,None,None,Watkins Mill High '96,None,None,Washington Square Vi,None,None,None
5,815616,Michael Boylan,2004-11-17,None,NYU,Grad Student,None,NaT,None,None,None,None,None,None,None,None,None,None,None
6,820480,Esra Temel,2005-03-18,None,NYU,Undergrad,None,NaT,None,None,None,None,None,None,None,None,None,None,None
7,821248,Stephen Hodde,2005-04-06,None,NYU,Undergrad,None,NaT,None,None,None,None,None,None,None,None,None,None,None
8,822528,Daniel Margulies,2005-05-02,None,NYU,Undergrad,None,NaT,None,None,None,None,None,None,None,None,None,None,None
9,824064,Yasmine Rahmanan,2005-05-27,None,NYU,Alumnus/Alumna,None,NaT,None,None,None,None,None,None,None,None,None,None,None